# BRepBuilderGeometryId Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BRepBuilderGeometryId Members
BRepBuilderGeometryId Class Constructors Methods Properties See Also
---
The BRepBuilderGeometryId type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BRepBuilderGeometryId | Copy constructor |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the BRepBuilderGeometryId |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| InvalidGeometryId | Returns an invalid BRepBuilderGeometryId, used as a return value to indicate an error. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
BRepBuilderGeometryId Class
Autodesk.Revit.DB Namespace